app/views/books/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]
---
<h2>Reviews</h2>
<%	@book.reviews.each do	|review|	%>