app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT 1 AS one FROM "books" WHERE "books"."isbn" = ? LIMIT ?  [["isbn", "1110000000"], ["LIMIT", 1]]
INSERT INTO "books" ("title", "author", "isbn", "copies", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "a"], ["author", "b"], ["isbn", "c"], ["copies", "d"], ["created_at", "2020-12-03 00:41:06.001421"], ["updated_at", "2020-12-03 00:41:06.001421"]]
---
  def search
    @books = Array.new
    Book.all.each do |book|
      unless params[:book]["title"] == ""
        next unless book.title.include? params[:book]["title"]
      end
      unless params[:book]["author"] == ""
        next unless book.author.include? params[:book]["author"]
      end
      unless params[:book]["isbn"] == ""
        next unless book.isbn.include? params[:book]["isbn"]
      end
      @books << book

INSERT INTO "books" ("title", "author", "isbn", "copies", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "book1"], ["author", "author1"], ["isbn", "1110000000"], ["copies", "2"], ["created_at", "2020-12-03 17:07:30.465961"], ["updated_at", "2020-12-03 17:07:30.465961"]]
---
  def create
    @book = Book.new(params.require(:book).permit(:title, :author, :isbn, :copies))
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "isbn" = ?, "copies" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["isbn", "1110001000"], ["copies", "2"], ["updated_at", "2020-12-03 17:08:01.755567"], ["id", 4]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(params.require(:book).permit(:title, :author, :isbn, :copies))

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "copies" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["copies", "1"], ["updated_at", "2020-12-03 17:07:47.447138"], ["id", 4]]
---
  def checkout
    @book = Book.find(params[:id])
    @book.update_attribute(:copies, (@book.copies.to_i - 1).to_s)