app/controllers/patron_controller.rb

  def searchresults
    @books = Array.new
    Book.all.each do |book|
---
SELECT "books".* FROM "books"