app/controllers/reviews_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @book = Book.find(params[:book_id])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("reviewer", "body", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["reviewer", "me"], ["body", "good"], ["book_id", 1], ["created_at", "2020-12-03 16:58:51.564765"], ["updated_at", "2020-12-03 16:58:51.564765"]]
---
  def create
    @book = Book.find(params[:book_id])
    @review = @book.reviews.create(params.require(:review).permit(:reviewer, :body))